app/controllers/api/events_controller.rb

  def index
  	respond_with Event.all
---
SELECT "events".* FROM "events"